# ExportFontInfo Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportFontInfo Members
ExportFontInfo Class Constructors Methods Properties See Also
---
The ExportFontInfo type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExportFontInfo()()()() | Constructs a new default ExportFontInfo. |
| ExportFontInfo(String) | Constructs a new ExportFontInfo using the destination font name as input. |
| ExportFontInfo(ExportFontInfo) | Constructs a new copy of the input ExportFontInfo object. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ExportFontInfo |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DestinationFontName | The destination font name (the name of the font in the exported format). |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ExportFontInfo Class
Autodesk.Revit.DB Namespace